/**
 * Task0 :Напишите программу, выводящую в консоль It's alive! It's alive!
 */
public class Task_0 {
    public static void solve() {
        System.out.println("It's alive! It's alive!");
    }
}

// jar cfe test.jar HelloWorld HelloWorld.class - создание jar-файла
// Java Hotspot - это JVM от Oracle